CSI API ETABS v1
cLoadCases.DirHistLinear Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cCaseDirectHistoryLinear DirHistLinear { get; }
ReadOnly Property DirHistLinear As cCaseDirectHistoryLinear
	Get
Dim instance As cLoadCases
Dim value As cCaseDirectHistoryLinear
value = instance.DirHistLinear
property cCaseDirectHistoryLinear^ DirHistLinear {
	cCaseDirectHistoryLinear^ get ();
}
abstract DirHistLinear : cCaseDirectHistoryLinear with get
Property Value
Type: cCaseDirectHistoryLinear
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace